<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5b9bd982692970f9e7d75caa52327f96e73546a8709ba356bfe08fddc869dfc8","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1363 at https://github.com/cal-itp/data-infra/actions/runs/21013178743","plan_out_hash":"d99d8abd4cc7f4a904a92f4d3b32699949346c34241bf1cee2d807d08590900b","plan_hash":"09da7c6f3cceb2fe7d3cc02d744deeeb2ff95c73b54b8e4aa4af5ff9a4ad61f9","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/blackcat_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "s7BJ7Q==" -> (known after apply)
!~      detect_md5hash      = "husvfrVLOwWESpUczaAT3w==" -> "different hash"
!~      generation          = 1764100337091773 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/blackcat_to_gcs_operator.py"
!~      md5hash             = "husvfrVLOwWESpUczaAT3w==" -> (known after apply)
        name                = "plugins/operators/blackcat_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "qflZFg==" -> (known after apply)
!~      detect_md5hash      = "0nGFHPvKczlr6OgvO9t83A==" -> "different hash"
!~      generation          = 1768421227899364 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "0nGFHPvKczlr6OgvO9t83A==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "I75cyQ==" -> (known after apply)
!~      detect_md5hash      = "77K7xlk4Xe76JEFlGaosQw==" -> "different hash"
!~      generation          = 1768421229313140 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "77K7xlk4Xe76JEFlGaosQw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1363](https://github.com/cal-itp/data-infra/actions/runs/21013178743)